Revit 2027 API
IFCParameterTemplate.Create Method
 Create an IFC parameter mapping template with default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCParameterTemplate Create(
	Document document,
	string name
)
Public Shared Function Create (
	document As Document,
	name As String
) As IFCParameterTemplate
public:
static IFCParameterTemplate^ Create(
	Document^ document,
	String^ name
)
static member Create :
        document : Document *
        name : string -> IFCParameterTemplate
Parameters
document Document
 The document where created mapping template is saved.
name String
 The name specified to this mapping template.
Return Value
IFCParameterTemplate
 The new mapping template instance.
Exceptions
Exception | Condition
ArgumentException |  The name already exists.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace